duxinglang-1/nRF9160_test/E2_V3_TEST/src/nb/nb.c
		if((fds.revents & POLLNVAL) == POLLNVAL)
		{
		#ifdef NB_DEBUG
			LOGD("POLLNVAL");
		#endif
			break;
		}
	}
#ifdef NB_DEBUG	
	LOGD("Disconnecting MQTT client...");
#endif

	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}

	return;

link_over:
	mqtt_connecting_flag = false;
#ifdef NB_DEBUG
	LOGD("mqtt link err");
#endif
}

static void SendDataCallBack(struct k_timer *timer)
{
	send_data_flag = true;
}

static void NbSendDataStart(void)
{
	k_timer_start(&send_data_timer, K_MSEC(500), K_NO_WAIT);
}

static void NbSendDataStop(void)
{
	k_timer_stop(&send_data_timer);
}

static void NbSendData(void)
{
	uint8_t data_type,*p_data;
	uint32_t data_len;
	int ret;

	ret = get_data_from_cache(&nb_send_cache, &p_data, &data_len, &data_type);
	if(ret)
	{
		if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
			k_timer_stop(&mqtt_disconnect_timer);
		k_timer_start(&mqtt_disconnect_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME), K_NO_WAIT);
		
		ret = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE, p_data, data_len);
		if(!ret)
		{
			delete_data_from_cache(&nb_send_cache);
			k_timer_start(&send_data_timer, K_MSEC(500), K_NO_WAIT);
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("mqtt send fail, wait act timerout and recount!");
		#endif
		}
	}
}

bool MqttIsConnected(void)
{
#ifdef NB_DEBUG
	LOGD("mqtt_connected:%d", mqtt_connected);
#endif
	return mqtt_connected;
}

void DisConnectMqttLink(void)
{
	int err;
		
	if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
		k_timer_stop(&mqtt_disconnect_timer);

	if(mqtt_connected)
	{
		err = mqtt_disconnect(&client);
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Could not disconnect MQTT client. Error: %d", err);
		#endif
		}
		
		mqtt_connected = false;
	}
}

static void MqttDisConnect(void)
{
	int err;

#ifdef NB_DEBUG
	LOGD("begin");
#endif
	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}
}

static void MqttDisConnectCallBack(struct k_timer *timer_id)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	mqtt_disconnect_flag = true;
}

static void MqttDicConnectStart(void)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	k_timer_start(&mqtt_disconnect_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME), K_NO_WAIT);
}

static void MqttDicConnectStop(void)
{
	k_timer_stop(&mqtt_disconnect_timer);
}


/**@brief Callback handler for LTE RSRP data. */
static void modem_rsrp_handler(char rsrp_value)
{
	/* RSRP raw values that represent actual signal strength are
	 * 0 through 97 (per "nRF91 AT Commands" v1.1). If the received value
	 * falls outside this range, we should not send the value.
	 */
#ifdef NB_DEBUG
	LOGD("rsrp_value:%d", rsrp_value);
#endif
	if(g_rsrp != rsrp_value)
	{
		if((g_rsrp == 255)&&(rsrp_value != 0))
		{
			if(!server_has_timed_flag)
				k_timer_start(&get_nw_time_timer, K_MSEC(500), K_NO_WAIT);
		}

		g_rsrp = rsrp_value;
		nb_redraw_sig_flag = true;
	}
}

#ifdef CONFIG_MODEM_INFO
/**brief Initialize LTE status containers. */
void modem_data_init(void)
{
	int err;

	err = modem_info_init();
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Modem info could not be established: %d", err);
	#endif
		return;
	}

	modem_info_params_init(&modem_param);
	modem_info_rsrp_register(modem_rsrp_handler);
}
#endif /* CONFIG_MODEM_INFO */

/**@brief Configures modem to provide LTE link. Blocks until link is
 * successfully established.
 */
static void modem_configure(void)
{
	uint8_t buf[128] = {0};
	
	if(test_nb_flag)
	{
		strcpy(nb_test_info, "modem_configure");
	#ifdef NB_SIGNAL_TEST	
		TestNBUpdateINfor();
	#endif
	#ifdef CONFIG_FACTORY_TEST_SUPPORT	
		FTNetStatusUpdate(0);
	#endif
	}

#if defined(CONFIG_LTE_LINK_CONTROL)
	if (IS_ENABLED(CONFIG_LTE_AUTO_INIT_AND_CONNECT))
	{
		/* Do nothing, modem is already turned on
		 * and connected.
		 */
	}
	else
	{
		int err;

	#ifdef NB_DEBUG
		LOGD("LTE Link Connecting ...");
	#endif
		if(test_nb_flag)
		{
			strcpy(nb_test_info, "LTE Link Connecting ...");
		#ifdef NB_SIGNAL_TEST
			TestNBUpdateINfor();
		#endif
		#ifdef CONFIG_FACTORY_TEST_SUPPORT	
			FTNetStatusUpdate(0);
		#endif
		}
		err = lte_lc_init_and_connect();
		__ASSERT(err == 0, "LTE link could not be established.");
	#ifdef NB_DEBUG
		LOGD("LTE Link Connected!");
	#endif

		if(test_nb_flag)
		{
			strcpy(nb_test_info, "LTE Link Connected!");
		#ifdef NB_SIGNAL_TEST
			TestNBUpdateINfor();
		#endif
		#ifdef CONFIG_FACTORY_TEST_SUPPORT	
			FTNetStatusUpdate(0);
		#endif	
			k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_NO_WAIT);
		}
	}
#endif /* defined(CONFIG_LTE_LINK_CONTROL) */
}

void test_nb(void)
{
	test_nb_on = true;
}

void MenuStartNB(void)
{
	test_nb_on = true;
}

void MenuStopNB(void)
{
	nb_is_running = false;
	test_nb_flag = false;

	if(k_timer_remaining_get(&get_nw_rsrp_timer) > 0)
		k_timer_stop(&get_nw_rsrp_timer);
}

#ifdef CONFIG_FACTORY_TEST_SUPPORT
void FTStopNet(void)
{
	nb_is_running = false;
	test_nb_flag = false;

	if(k_timer_remaining_get(&get_nw_rsrp_timer) > 0)
		k_timer_stop(&get_nw_rsrp_timer);
}

void FTStartNet(void)
{
	test_nb_on = true;
}

void FTPreReadyNet(void)
{
	struct k_work_sync work_sync;

	if(k_work_pending(&mqtt_link_work))
		k_work_cancel_delayable(&mqtt_link_work);
	if(k_work_pending(&nb_link_work))
		k_work_cancel_delayable(&nb_link_work);

	SetModemTurnOff();
}
#endif

void NBGetNetMode(uint8_t *at_mode_set)
{
	uint8_t *p1,*p2;
	uint8_t tmpbuf[8] = {0};
	
	p1 = strstr(at_mode_set, "AT%XSYSTEMMODE");
	if(p1 != NULL)
	{
		p1 += strlen("AT%XSYSTEMMODE");
		p2 = strstr(p1, ",");
		if(p2 != NULL)
		{
			p1 = p2+1;
			p2 = strstr(p1, ",");
			if(p2 != NULL)
			{
				memcpy(tmpbuf, p1, p2-p1);
				if(atoi(tmpbuf) == 1)
					g_net_mode = NET_MODE_NB;
				else
					g_net_mode = NET_MODE_LTE_M;
			}
		}
	}
}

void NBRedrawNetMode(void)
{
	if((screen_id == SCREEN_ID_IDLE)
		||(screen_id == SCREEN_ID_HR)
		||(screen_id == SCREEN_ID_SPO2)
		||(screen_id == SCREEN_ID_BP)
		||(screen_id == SCREEN_ID_TEMP)
		||(screen_id == SCREEN_ID_STEPS)
		||(screen_id == SCREEN_ID_SLEEP)
		)
	{
		scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_NET_MODE;
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void NBRedrawSignal(void)
{
	uint8_t *ptr;
	bool flag=false;
	uint8_t strbuf[128] = {0};
	uint8_t tmpbuf[128] = {0};

