duxinglang-1/nRF9160_test/E2_V3_TEST/src/nb/nb.c
#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived())
		return;
#endif

	if(nrf_modem_at_cmd(strbuf, sizeof(strbuf), CMD_GET_REG_STATUS) == 0)
	{
		//+CEREG: <n>,<stat>[,[<tac>],[<ci>],[<AcT>][,<cause_type>],[<reject_cause>][,[<Active-Time>],[<Periodic-TAU>]]]]
		//<n>
		//	0 – Disable unsolicited result codes
		//	1 – Enable unsolicited result codes +CEREG:<stat>
		//	2 – Enable unsolicited result codes +CEREG:<stat>[,<tac>,<ci>,<AcT>]
		//	3 – Enable unsolicited result codes +CEREG:<stat>[,<tac>,<ci>,<AcT>[,<cause_type>,<reject_cause>]]
		//	4 – Enable unsolicited result codes +CEREG: <stat>[,[<tac>],[<ci>],[<AcT>][,,[,[<Active-Time>],[<Periodic-TAU>]]]]
		//	5 – Enable unsolicited result codes +CEREG: <stat>[,[<tac>],[<ci>],[<AcT>][,[<cause_type>],[<reject_cause>][,[<ActiveTime>],[<Periodic-TAU>]]]]
		//<stat>
		//	0 – Not registered. UE is not currently searching for an operator to register to.
		//	1 – Registered, home network.
		//	2 – Not registered, but UE is currently trying to attach or searching an operator to register to.
		//	3 – Registration denied.
		//	4 – Unknown (e.g. out of E-UTRAN coverage).
		//	5 – Registered, roaming.
		//	8 – Attached for emergency bearer services only.
		//	90 – Not registered due to UICC failure.
		//<tac>
		//	String. A 2-byte Tracking Area Code (TAC) in hexadecimal format.
		//<ci>
		//	String. A 4-byte E-UTRAN cell ID in hexadecimal format.
		//<AcT>
		//	7 – E-UTRAN
		//	9 – E-UTRAN NB-S1
		//<cause_type>
		//	0 – <reject_cause> contains an EPS Mobility Management (EMM) cause value. See 3GPP TS 24.301 Annex A.
		//<reject_cause>
		//	EMM cause value. See 3GPP TS 24.301 Annex A
		//<Active-Time>
		//	String. One byte in an 8-bit format.
		//	Indicates the Active Time value (T3324) allocated to the device in E-UTRAN. For the coding and value range, see the GPRS Timer 2 IE in 3GPP TS 24.008 Table 10.5.163/3GPP TS 24.008.
		//<Periodic-TAU>
		//	String. One byte in an 8-bit format.
		//	Indicates the extended periodic TAU value (T3412) allocated to the device in EUTRAN. For the coding and value range, see the GPRS Timer 3 IE in 3GPP TS 24.008 Table 10.5.163a/3GPP TS 24.008.
		uint8_t *ptr;
		uint8_t reg_status;
		
	#ifdef NB_DEBUG
		LOGD("%s", strbuf);
	#endif

		ptr = strstr(strbuf, "+CEREG: ");
		if(ptr)
		{
			//指令头
			ptr += strlen("+CEREG: ");
			//reg_status
			GetStringInforBySepa(ptr, ",", 2, tmpbuf);
			reg_status = atoi(tmpbuf);
		#ifdef NB_DEBUG
			LOGD("reg_status:%d", reg_status);
		#endif
			
			if(reg_status == 1 || reg_status == 5)
			{
				g_nw_registered = true;
			}
			else
			{
			#ifdef NB_DEBUG
				LOGD("registered:%d,mqtt_connected:%d,nb_connected:%d", g_nw_registered, mqtt_connected, nb_connected);
			#endif
				if(g_nw_registered)
				{
					g_nw_registered = false;
					mqtt_connected = false;
					nb_connected = false;

					if(k_timer_remaining_get(&nb_reconnect_timer) == 0)
						k_timer_start(&nb_reconnect_timer, K_SECONDS(10), K_NO_WAIT);
				}
			}
		}
	}

	if(nrf_modem_at_cmd(strbuf, sizeof(strbuf), "AT+CSCON?") == 0)
	{
		//+CSCON: <n>,<mode>[,<state>[,<access]]
		//<n>
		//0 – Unsolicited indications disabled
		//1 – Enabled: <mode>
		//2 – Enabled: <mode>[,<state>]
		//3 – Enabled: <mode>[,<state>[,<access>]]
		//<mode>
		//0 – Idle
		//1 – Connected
		//<state>
		//7 – E-UTRAN connected
		//<access>
		//4 – Radio access of type E-UTRAN FDD
	#ifdef NB_DEBUG
		LOGD("%s", strbuf);
	#endif
		ptr = strstr(strbuf, "+CSCON: ");
		if(ptr)
		{
			uint8_t mode;
			uint16_t len;

			len = strlen(strbuf);
			strbuf[len-2] = ',';
			strbuf[len-1] = 0x00;
			
			ptr += strlen("+CSCON: ");
			GetStringInforBySepa(ptr,",",2,tmpbuf);
			mode = atoi(tmpbuf);
		#ifdef NB_DEBUG
			LOGD("mode:%d", mode);
		#endif
			if(mode == 1)//connected
			{
				flag = true;	
			}
			else if(mode == 0)//idle
			{
			#ifdef NB_DEBUG
				LOGD("reg stat:%d", g_nw_registered);
			#endif
				if(g_nw_registered) 			//registered
				{
					flag = false;				//don't show no signal when ue is psm idle mode in registered, 
				}
				else							//not registered
				{
					flag = true;	
				}
			}
		}
	}

	if(g_rsrp > 97)
	{
		if(flag)
			g_nb_sig = NB_SIG_LEVEL_NO;
	}
	else if(g_rsrp >= 75)
	{
		g_nb_sig = NB_SIG_LEVEL_4;
	}
	else if(g_rsrp >= 55)
	{
		g_nb_sig = NB_SIG_LEVEL_3;
	}
	else if(g_rsrp >= 35)
	{
		g_nb_sig = NB_SIG_LEVEL_2;
	}
	else if(g_rsrp >= 15)
	{
		g_nb_sig = NB_SIG_LEVEL_1;
	}
	else
	{
		g_nb_sig = NB_SIG_LEVEL_0;
	}

	if((screen_id == SCREEN_ID_IDLE)
		||(screen_id == SCREEN_ID_HR)
		||(screen_id == SCREEN_ID_SPO2)
		||(screen_id == SCREEN_ID_BP)
		||(screen_id == SCREEN_ID_TEMP)
		||(screen_id == SCREEN_ID_STEPS)
		||(screen_id == SCREEN_ID_SLEEP)
		)
	{
		scr_msg[screen_id].para |= (SCREEN_EVENT_UPDATE_SIG|SCREEN_EVENT_UPDATE_NET_MODE);
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}
}

void GetStringInforBySepa(uint8_t *sour_buf, uint8_t *key_buf, uint8_t pos_index, uint8_t *outbuf)
{
	uint8_t *ptr1,*ptr2;
	uint8_t count=0;
	
	if(sour_buf == NULL || key_buf == NULL || outbuf == NULL || pos_index < 1)
		return;

	ptr1 = sour_buf;
	while(1)
	{
		ptr2 = strstr(ptr1, key_buf);
		if(ptr2)
		{
			count++;
			if(count == pos_index)
			{
				memcpy(outbuf, ptr1, (ptr2-ptr1));
				return;
			}
			else
			{
				ptr1 = ptr2+1;
			}
		}
		else
		{
			return;
		}
	}
}

void GetModemDateTime(void)
{
	char *ptr;
	uint8_t timebuf[128] = {0};
	uint8_t tmpbuf[10] = {0};
	uint8_t tz_dir[3] = {0};
	uint8_t tz_count,daylight;
	static uint8_t retry = 5;
	sys_date_timer_t tmp_dt = {0};

	if(nrf_modem_at_cmd(timebuf, sizeof(timebuf), "AT+CCLK?") != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Get CCLK fail!");
	#endif
	
	#ifdef CONFIG_FACTORY_TEST_SUPPORT
	  	if(FactryTestActived())
	  		return;
	#endif/*CONFIG_FACTORY_TEST_SUPPORT*/

		if(nb_connected && (retry > 0))
		{
			retry--;
			k_timer_start(&get_nw_time_timer, K_MSEC(1000), K_NO_WAIT);
		}
		return;
	}

	retry = 5;

#ifdef NB_DEBUG	
	LOGD("%s", timebuf);
#endif
	//%CCLK: "21/02/26,08:31:33+32",0
	//+CCLK: "22/08/16,10:30:41+32"
	ptr = strstr(timebuf, "\"");
	if(ptr)
	{
		ptr++;
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.year = 2000+atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.month= atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.day = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.hour = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.minute = atoi(tmpbuf);

		ptr+=3;
		memset(tmpbuf, 0, sizeof(tmpbuf));
		memcpy(tmpbuf, ptr, 2);
		tmp_dt.second = atoi(tmpbuf);

