duxinglang-1/nRF9160_test/E2_V3_TEST/src/nb/nb.c
void SetNetWorkParaByPlmn(uint8_t *imsi)
{
	//SetNetWorkApn(imsi);
	SetNwtWorkMqttBroker(imsi);
}

void GetModemInfor(void)
{
	uint8_t tmpbuf[256] = {0};

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_MODEM_V) == 0)
	{
		strncpy(g_modem, &tmpbuf, MODEM_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("MODEM version:%s", g_modem);
	#endif	
	}

#if 0
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_SUPPORT_BAND) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("support band:%s", tmpbuf);
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_CUR_BAND) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("current band:%s", tmpbuf);
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_LOCKED_BAND) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("locked band:%s", tmpbuf);
	#endif
	}
#endif

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_IMEI) == 0)
	{
		strncpy(g_imei, tmpbuf, IMEI_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("imei:%s", g_imei);
	#endif	
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_IMSI) == 0)
	{
		strncpy(g_imsi, tmpbuf, IMSI_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("imsi:%s", g_imsi);
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_ICCID) == 0)
	{
		strncpy(g_iccid, &tmpbuf[9], ICCID_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("iccid:%s", g_iccid);
	#endif
	}
}

void GetModemStatus(void)
{
	char *ptr;
	int i=0,len,err;
	uint8_t strbuf[64] = {0};
	uint8_t tmpbuf[256] = {0};

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_MODEM_PARA) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("MODEM parameter:%s", &tmpbuf);
	#endif
		DecodeModemMonitor(tmpbuf, strlen(tmpbuf));
	}
}

void SetModemTurnOn(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN?") == 0)
	{
		uint8_t *ptr,ret,tmpbuf[10] = {0};

	#ifdef NB_DEBUG
		LOGD("modem status:%s", buf);
	#endif

		ptr = strstr(buf, "+CFUN: ");
		if(ptr)
		{
			ptr += strlen("+CFUN: ");
			memcpy(tmpbuf, ptr, 1);
			ret = atoi(tmpbuf);
			if(ret == 1)
			{
			#ifdef NB_DEBUG
				LOGD("modem has been turn on, return!");
			#endif
				return;
			}
		}
	}
	
	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN=1") == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn on modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn on modem!");
	#endif
	}
}

void SetModemTurnOff(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN?") == 0)
	{
		uint8_t *ptr,ret,tmpbuf[10] = {0};

	#ifdef NB_DEBUG
		LOGD("modem status:%s", buf);
	#endif

		ptr = strstr(buf, "+CFUN: ");
		if(ptr)
		{
			ptr += strlen("+CFUN: ");
			memcpy(tmpbuf, ptr, 1);
			ret = atoi(tmpbuf);
			if(ret == 0)
			{
			#ifdef NB_DEBUG
				LOGD("modem has been turn off, return!");
			#endif
				return;
			}
		}
	}
	
	if(mqtt_connected)
		DisConnectMqttLink();

	nb_connected = false;
	mqtt_connected = false;

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN=0") == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn off modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn off modem!");
	#endif
	}
}

void AppSetModemOn(void)
{
	k_delayed_work_submit_to_queue(app_work_q, &modem_on_work, K_NO_WAIT);
}

void AppSetModemOff(void)
{
	k_delayed_work_submit_to_queue(app_work_q, &modem_off_work, K_NO_WAIT);
}

void SetModemGps(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_GPS) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("set modem for gps success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("set modem for gps fail!");
	#endif
	}
}

void GetModemNw(void)
{
	int err;
	enum lte_lc_system_mode mode;

	err = lte_lc_system_mode_get(&mode, NULL);
	if(err)
	{
		return;
	}

	switch(mode)
	{
	case LTE_LC_SYSTEM_MODE_LTEM:
	case LTE_LC_SYSTEM_MODE_LTEM_GPS:
		g_net_mode = NET_MODE_LTE_M;
		break;
		
	case LTE_LC_SYSTEM_MODE_NBIOT:
	case LTE_LC_SYSTEM_MODE_NBIOT_GPS:
		g_net_mode = NET_MODE_NB;
		break;
		
	default:
		g_net_mode = NET_MODE_MAX;
		break;
	}
}

void SetModemNw(void)
{
	uint8_t buf[128] = {0};

#if defined(CONFIG_LTE_NETWORK_MODE_NBIOT)
	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_NB) == 0)
#elif defined(CONFIG_LTE_NETWORK_MODE_NBIOT_GPS)
	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_NB_GPS) == 0)
#elif defined(CONFIG_LTE_NETWORK_MODE_LTE_M)
	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_LTE_M) == 0)
#elif defined(CONFIG_LTE_NETWORK_MODE_LTE_M_GPS)
	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_LTE_M_GPS) == 0)
#endif
	{
	#ifdef NB_DEBUG
		LOGD("set modem for nw success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("set modem for nw fail!");
	#endif
	}
}

void GetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_APN) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("apn:%s", tmpbuf);	
	#endif
	}
}

void SetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), "AT+CGDCONT=0,\"IP\",\"arkessalp.com\"") != 0)
	{
	#ifdef NB_DEBUG
		LOGD("set apn fail!");
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_APN) != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Get apn fail!");
	#endif
		return;
	}
#ifdef NB_DEBUG
	LOGD("apn:%s", tmpbuf);	
#endif
}

static void modem_init(struct k_work *work)
{
#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived()&&!IsFTNetTesting())
		return;
#endif

	SetModemTurnOn();

	k_delayed_work_submit_to_queue(app_work_q, &nb_link_work, K_SECONDS(5));
}

static void modem_on(struct k_work *work)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif

	SetModemTurnOn();
}

static void modem_off(struct k_work *work)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif

	SetModemTurnOff();
}

static void nb_link(struct k_work *work)
{
	int err=0;
	uint8_t tmpbuf[128] = {0};
	static bool frist_flag = false;

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived()&&!IsFTNetTesting())
		return;
#endif

	if(!frist_flag)
	{
		frist_flag = true;
		GetModemInfor();
		SetModemTurnOff();
		SetNetWorkParaByPlmn(g_imsi);
	}
	else
	{
		SetModemTurnOff();
	}

#ifndef NB_SIGNAL_TEST
	if(strlen(g_imsi) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("Can't get sim info, cancel the connecting!");
	#endif
		return;
	}
#endif

