duxinglang-1/nRF9160_test/E2_V3_TEST/src/nb/nb.c
		if(test_gps_flag || mqtt_connected
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| FactryTestActived()
		#endif
			)
			return;

	#ifdef NB_DEBUG
		LOGD("mqtt_reconnect_flag 001");
	#endif
		if(!mqtt_connecting_flag)
		{
			k_delayed_work_submit_to_queue(app_work_q, &mqtt_link_work, K_SECONDS(2));
		}
		else
		{
			k_timer_start(&mqtt_reconnect_timer, K_SECONDS(10), K_NO_WAIT);
		}		
	}

	if(mqtt_act_wait_flag)
	{
	#ifdef NB_DEBUG
		LOGD("mqtt_act_wait_flag begin");
	#endif
		mqtt_act_wait_flag = false;

		if(test_gps_flag
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| FactryTestActived()
		#endif
			)
			return;

	#ifdef NB_DEBUG
		LOGD("mqtt_act_wait_flag 001");
	#endif
		DisConnectMqttLink();
		mqtt_connected = false;
		nb_connected = false;
		nb_redraw_sig_flag = true;

		if(!nb_connecting_flag)
		{
			k_delayed_work_submit_to_queue(app_work_q, &nb_link_work, K_SECONDS(2));
		}
		else
		{
			net_retry_count = 0;
			k_timer_start(&nb_reconnect_timer, K_SECONDS(30), K_NO_WAIT);
		}
	}

	if(nb_connecting_flag)
	{
		k_sleep(K_MSEC(5));
	}
}

void NB_init(struct k_work_q *work_q)
{
	int err;

	app_work_q = work_q;

	k_delayed_work_init(&modem_init_work, modem_init);
	k_delayed_work_init(&modem_on_work, modem_on);
	k_delayed_work_init(&modem_off_work, modem_off);
	k_delayed_work_init(&nb_link_work, nb_link);
	k_delayed_work_init(&mqtt_link_work, mqtt_link);
#ifdef CONFIG_FOTA_DOWNLOAD
	fota_work_init(work_q);
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	dl_work_init(work_q);
#endif

	k_delayed_work_submit_to_queue(app_work_q, &modem_init_work, K_SECONDS(2));
}
